//
//  Data.swift
//  ioshw01ebook
//
//  Created by User08 on 2019/10/17.
//  Copyright © 2019 ntou. All rights reserved.
//

import Foundation
 

let roles = [Role(name: "皇帝企鵝", image: "皇帝企鵝", text: "為企鵝家族中個體最大的，一般身高在90厘米以上，最大可達到120厘米，體重可達50千克。脖子底下有一片橙黃色羽毛，向下逐漸變淡，耳朵後部最深，全身色澤協調，頸部為淡黃色，耳朵的羽毛鮮黃橘色，腹部乳白色，背部及鰭狀肢則是黑色，鳥喙的下方是鮮桔色。"), Role(name: "國王企鵝", image: "國王企鵝", text: "體長近1米，體重約15～16千克。頸側有一明顯的橘黃色斑塊，前肢發育成為鰭腳，適於划水，具鱗片狀羽毛，羽軸寬而短，羽片狹窄而密集，均勻分佈於體表，骨骼沉重而不充氣，胸骨具有發達的龍骨突起，內含有多脂肪的骨髓，且尾羽短。"), Role(name: "巴布亞企鵝", image: "巴布亞企鵝", text: "體形較大，身長約60～80厘米，重約6公斤，眼睛上方有一個明顯的白斑，嘴細長，嘴角呈紅色，眼角處有一個紅色的三角形，顯得眉清目秀。生活在較南地區的巴布亞企鵝以吃磷蝦為主，生活在較北的則較多以魚類為食，11月來到棲息地交配，12月底～1月左右產下雛鳥，之後1 ～3月份就由父母撫育雛鳥，一直到夏季結束。"), Role(name: "阿德利企鵝", image: "阿德利企鵝", text: "屬中、小型種類，體長72～76厘米，具有攻擊性。適於海洋中的游泳生活，翼成鰭狀，變為游泳器官，食物主要是鱗蝦、烏賊和海洋魚類。喜集群活動，群體可達幾十隻到上百隻，在繁殖期形成1雄1雌的配偶關係，並集大群在陸地繁殖。"), Role(name: "帽帶企鵝", image: "帽帶企鵝", text: "體長72厘米，成年的南極企鵝平均重約4千克。其頭部下面有一條黑色的紋帶，使它們看上去好像在戴著盔帽一般，故又稱頰帶企鵝，亦因為有這些特徵成為了最容易被辨認的企鵝之一。"), Role(name: "黃眉企鵝", image: "黃眉企鵝", text: "在頭上或眼睛旁都有彩色的冠毛，唯一不同在它的眼睛下方有白斑。前肢發育成為鰭腳，適於划水。具鱗片狀羽毛，羽軸寬而短，羽片狹窄而密集，均勻分佈於體表。骨骼沉重而不充氣，胸骨具有發達的龍骨突起，內含有多脂肪的骨髓，尾羽短，跗蹠短，並移至軀體後方，跗間具蹼。 "), Role(name: "冠毛企鵝", image: "冠毛企鵝", text: "身高60公分左右，體重約6.5公斤，有如巧克力棕色般的眼睛，兩眼旁各有一撮向上矗立的冠毛，分佈於新西蘭一帶水域，主食魚、磷蝦及烏賊，目前世界生存數量為20萬對。"), Role(name: "馬可羅尼企鵝", image: "馬可羅尼企鵝", text: "體長約70厘米，體重約5.5千克。雙眼間有左右相連的橘色的裝飾羽毛，由於頭頂上那一撮撮像意大利面的羽毛，因而又名“通心面企鵝”，喙角有粉色的羽圈。和所有企鵝一樣擁有很強的潛水本領，但不會飛行，其外形很容易與鳳頭黃眉企鵝混淆。"), Role(name: "藍企鵝", image: "藍企鵝", text: "體型最小的物種，普遍身高43厘米，體重約為1千克，雄性的體型比雌性的略大一點。有一身藍色的羽毛，也是唯一一種有藍色羽毛的企鵝。 頭部和背部呈靛藍色，耳部呈青灰色，到腹部則為白色。 鰭外部為靛藍色，內部的那一面則呈白色。喙為深灰黑色，長約3至4厘米，腳部朝天的一方為白色，腳底和蹼則呈黑色。"), Role(name: "皇帝企鵝", image: "皇帝企鵝", text: ""), Role(name: "麥哲倫企鵝", image: "麥哲倫企鵝", text: "中等身材，一般身高約70厘米，體重約4公斤。頭部主要呈黑色，有一條白色的寬帶從眼後過耳朵一直延伸至下頜附近。分佈於南美洲阿根廷、智利和多風暴的、岩石聳立的南美洲南海岸和富克蘭群島沿海，也有少量遷入巴西境內。"),]
   
